OpenFOAM-v1712/tutorials/incompressible/overPimpleDyMFoam/simpleRotor/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        sourceInfo
        {
            insidePoints ((0.001 0.001 0.001));
        }
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set c0;
        }
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }

    // Select box to remove from region 1

    {
        name    box;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set c1;
        }
    }

    {
        name    box;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            box (0.0025 0.0045 -100)(0.0075 0.0055 100);
        }
    }

    {
        name    box;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
